### Libraries

In [ ]:
import pandas as pd
import numpy as np

### Creation

#### from the list

creating a Series of values from a list of integers

In [ ]:
s = pd.Series(data=[10, 11, 12, 13, 14],
              index=[1, 2, 3, 5, 7])
s

1    10
2    11
3    12
5    13
7    14
dtype: int64

creating a Series from string values

In [ ]:
s = pd.Series(['Blue', 'Yellow', 'Green'])
s

0      Blue
1    Yellow
2     Green
dtype: object

creating a Series of 5 elements, each element is a python list

In [ ]:
l = [[1, 2]]
s = pd.Series(l*5)
s

0    [1, 2]
1    [1, 2]
2    [1, 2]
3    [1, 2]
4    [1, 2]
dtype: object

creating a Data Frame from a two-dimensional list

In [ ]:
df = pd.DataFrame([[10, 11], [20, 21], [30, 31]])
df

    0   1
0  10  11
1  20  21
2  30  31

setting column names

In [ ]:
df = pd.DataFrame([[10, 11], [20, 21], [30, 31]],
                  columns=['A', 'B'])
df

    A   B
0  10  11
1  20  21
2  30  31

creating a DataFrame for the list of Series objects

In [ ]:
series_1 = pd.Series([70, 90])
series_2 = pd.Series([71, 91])
df = pd.DataFrame([series_1, series_2])
df

    0   1
0  70  90
1  71  91

setting the column names after creating the dataframe

In [ ]:
df.columns = ['col_1', 'col_2']
df

   col_1  col_2
0     70     90
1     71     91

#### from the dictionary

creating a Series object from the dictionary, while looking at how the indexes have changed

In [ ]:
s = pd.Series({'Homer': 'Dad',
               'Marge': 'Mom',
               'Bart': 'Son',
               'Lisa': 'Daughter',
               'Maggie': 'Daughter'})
s

Homer          Dad
Marge          Mom
Bart           Son
Lisa      Daughter
Maggie    Daughter
dtype: object

creating a DataFrame using a python dictionary

In [ ]:
list_1 = [70, 71]
list_2 = [90, 91]
temperatures = {'col_1': list_1,
                'col_2': list_2}
pd.DataFrame(temperatures)

   col_1  col_2
0     70     90
1     71     91

creating a Data Frame using a dictionary consisting of Series objects

In [ ]:
series_1 = pd.Series([70, 71])
series_2 = pd.Series([90, 91])

df = pd.DataFrame({'col_1': series_1,
                   'col_2': series_2})
df

   col_1  col_2
0     70     90
1     71     91

#### using the functions

creating a Series using np. arange-a sequence of numbers from  **start** to **stop-1** with **step**:
```python 
np.arange(start, stop, step) 
```

In [ ]:
s = pd.Series(np.arange(15,25,2))
s

0    15
1    17
2    19
3    21
4    23
dtype: int64

creating a Series of 5 values that evenly divide the segment 0 to 9

In [ ]:
s = pd.Series(np.linspace(0, 9, 5))
s

0    0.00
1    2.25
2    4.50
3    6.75
4    9.00
dtype: float64

Random number generation.

We will fix the seed value, which will allow us to reproduce our results in the future

Creating a Series object from 5 normally distributed random numbers

In [ ]:
np.random.seed(123)
s = pd.Series(np.random.normal(size=5))
s

0   -1.085631
1    0.997345
2    0.282978
3   -1.506295
4   -0.578600
dtype: float64

Creating a 4x3 DataFrame object from random numbers

In [ ]:
np.random.seed(123)
df = pd.DataFrame(np.random.normal(size=12).reshape(4, 3),
                  index=['ind_1', 'ind_2', 'ind_3', 'ind_4'],
                  columns=['col_1', 'col_2', 'col_3'])
df

          col_1     col_2     col_3
ind_1 -1.085631  0.997345  0.282978
ind_2 -1.506295 -0.578600  1.651437
ind_3 -2.426679 -0.428913  1.265936
ind_4 -0.866740 -0.678886 -0.094709

#### [fom the file](http://pandas.pydata.org/pandas-docs/stable/user_guide/io.html#io-tools-text-csv-hdf5)

| Column Name        | Description
| ------------- |:-------------:|
|Symbol|Сокращенное название организации|
|Name|Полное название организации|
|Sector|Сектор экономики|
|Price|Стоимость акции|
|Dividend Yield|Дивидендная доходность|
|Price/Earnings|Цена / прибыль|
|Earnings/Share|Прибыль на акцию|
|Book Value|Балансовая стоимость компании|
|52 week low|52-недельный минимум|
|52 week high|52-недельный максимум|
|Market Cap|Рыночная капитализация|
|EBITDA|**E**arnings **b**efore **i**nterest, **t**axes, **d**epreciation and **a**mortization|
|Price/Sales|Цена / объём продаж|
|Price/Book|Цена / балансовая стоимость|
|SEC Filings|Ссылка *sec.gov*|

In [ ]:
pd.read_csv(filepath_or_buffer = "sp500.csv", sep = ';')

    Symbol,Name,Sector,Price,Dividend Yield,Price/Earnings,Earnings/Share,Book Value,52 week low,52 week high,Market Cap,EBITDA,Price/Sales,Price/Book,SEC Filings
0    MMM,3M Co.,Industrials,141.14,2.12,20.33,6.90,...
1    ABT,Abbott Laboratories,Health Care,39.60,1.82...
2    ABBV,AbbVie Inc.,Health Care,53.95,3.02,20.87,...
3    ACN,Accenture,Information Technology,79.79,2.3...
4    ACE,ACE Limited,Financials,102.91,2.21,10.00,1...
..                                                 ...
495  YHOO,Yahoo Inc.,Information Technology,35.02,,...
496  YUM,Yum! Brands Inc,Consumer Discretionary,74....
497  ZMH,Zimmer Holdings,Health Care,101.84,0.81,22...
498  ZION,Zions Bancorp,Financials,28.43,0.56,18.82...
499  ZTS,Zoetis Inc,Health Care,30.53,0.90,29.22,1....

[500 rows x 1 columns]

separator

In [ ]:
pd.read_csv(filepath_or_buffer = "sp500.csv", sep = ',')

    Symbol  ...                                        SEC Filings
0      MMM  ...  http://www.sec.gov/cgi-bin/browse-edgar?action...
1      ABT  ...  http://www.sec.gov/cgi-bin/browse-edgar?action...
2     ABBV  ...  http://www.sec.gov/cgi-bin/browse-edgar?action...
3      ACN  ...  http://www.sec.gov/cgi-bin/browse-edgar?action...
4      ACE  ...  http://www.sec.gov/cgi-bin/browse-edgar?action...
..     ...  ...                                                ...
495   YHOO  ...  http://www.sec.gov/cgi-bin/browse-edgar?action...
496    YUM  ...  http://www.sec.gov/cgi-bin/browse-edgar?action...
497    ZMH  ...  http://www.sec.gov/cgi-bin/browse-edgar?action...
498   ZION  ...  http://www.sec.gov/cgi-bin/browse-edgar?action...
499    ZTS  ...  http://www.sec.gov/cgi-bin/browse-edgar?action...

[500 rows x 15 columns]

number of rows

In [ ]:
pd.read_csv(filepath_or_buffer = "sp500.csv", sep = ',', nrows = 3)

  Symbol  ...                                        SEC Filings
0    MMM  ...  http://www.sec.gov/cgi-bin/browse-edgar?action...
1    ABT  ...  http://www.sec.gov/cgi-bin/browse-edgar?action...
2   ABBV  ...  http://www.sec.gov/cgi-bin/browse-edgar?action...

[3 rows x 15 columns]

columns

In [ ]:
pd.read_csv(filepath_or_buffer = "sp500.csv", sep = ',', nrows = 3,
            usecols=['Symbol', 'Sector', 'Price', 'Book Value'])

  Symbol       Sector   Price  Book Value
0    MMM  Industrials  141.14      26.668
1    ABT  Health Care   39.60      15.573
2   ABBV  Health Care   53.95       2.954

index

In [ ]:
pd.read_csv(filepath_or_buffer = "sp500.csv", sep = ',', nrows = 3,
           usecols=['Symbol', 'Sector', 'Price', 'Book Value'],
           index_col='Symbol')

             Sector   Price  Book Value
Symbol
MMM     Industrials  141.14      26.668
ABT     Health Care   39.60      15.573
ABBV    Health Care   53.95       2.954

iterator

In [ ]:
df_chunk = pd.read_csv(filepath_or_buffer = "sp500.csv", sep = ',',
                       chunksize=50,
                       usecols=['Symbol', 'Sector', 'Price', 'Book Value'],
                       index_col='Symbol')

In [ ]:
for df_tmp in df_chunk:
    print('DataFrame part:', df_tmp.shape)

DataFrame part: (50, 3)
DataFrame part: (50, 3)
DataFrame part: (50, 3)
DataFrame part: (50, 3)
DataFrame part: (50, 3)
DataFrame part: (50, 3)
DataFrame part: (50, 3)
DataFrame part: (50, 3)
DataFrame part: (50, 3)
DataFrame part: (50, 3)

In [ ]:
sp500 = pd.read_csv(filepath_or_buffer = "sp500.csv",
                    sep = ',',
                    usecols=['Symbol', 'Sector', 'Price', 'Book Value'],
                    index_col='Symbol')
sp500

                        Sector   Price  Book Value
Symbol
MMM                Industrials  141.14      26.668
ABT                Health Care   39.60      15.573
ABBV               Health Care   53.95       2.954
ACN     Information Technology   79.79       8.326
ACE                 Financials  102.91      86.897
...                        ...     ...         ...
YHOO    Information Technology   35.02      12.768
YUM     Consumer Discretionary   74.77       5.147
ZMH                Health Care  101.84      37.181
ZION                Financials   28.43      30.191
ZTS                Health Care   30.53       2.150

[500 rows x 3 columns]

### Features

#### creating a Series for examples

In [ ]:
Simpsons = pd.Series({'Homer': 120,
                      'Marge': 60,
                      'Bart': 35,
                      'Lisa': 30,
                      'Maggie': 7})

Simpsons

Homer     120
Marge      60
Bart       35
Lisa       30
Maggie      7
dtype: int64

In [ ]:
np.random.seed(123)
numbers = pd.Series(data = np.random.normal(size=10),
                    index = np.arange(25,35))
numbers

25   -1.085631
26    0.997345
27    0.282978
28   -1.506295
29   -0.578600
30    1.651437
31   -2.426679
32   -0.428913
33    1.265936
34   -0.866740
dtype: float64

#### data type

In [ ]:
Simpsons.dtype

dtype('int64')

In [ ]:
sp500.dtypes

Sector         object
Price         float64
Book Value    float64
dtype: object

#### number of elements

Series:

In [ ]:
print('The first method:', len(Simpsons))
print('The second method:', Simpsons.size)
print('The third method:', Simpsons.shape)

Первый способ: 5
Второй способ: 5
Третий способ: (5,)

DataFrame:

In [ ]:
print('The first method:', len(sp500))
print('The second method:', sp500.size)
print('The third method:', sp500.shape)

The first method: 500
The second method: 1500
The third method: (500, 3)

#### number of unique elements

In [ ]:
Simpsons.nunique()

5

In [ ]:
sp500.nunique()

Sector         13
Price         495
Book Value    495
dtype: int64

#### index and values

Series:

In [ ]:
Simpsons.index

Index(['Homer', 'Marge', 'Bart', 'Lisa', 'Maggie'], dtype='object')

In [ ]:
Simpsons.values

array([120,  60,  35,  30,   7])

DataFrame:

In [ ]:
sp500.index

Index(['MMM', 'ABT', 'ABBV', 'ACN', 'ACE', 'ACT', 'ADBE', 'AES', 'AET', 'AFL',
       ...
       'XEL', 'XRX', 'XLNX', 'XL', 'XYL', 'YHOO', 'YUM', 'ZMH', 'ZION', 'ZTS'],
      dtype='object', name='Symbol', length=500)

In [ ]:
sp500.values

array([['Industrials', 141.14, 26.668000000000003],
       ['Health Care', 39.6, 15.573],
       ['Health Care', 53.95, 2.9539999999999997],
       ...,
       ['Health Care', 101.84, 37.181],
       ['Financials', 28.43, 30.191],
       ['Health Care', 30.53, 2.15]], dtype=object)

In [ ]:
sp500.columns

Index(['Sector', 'Price', 'Book Value'], dtype='object')

#### assigning / changing a name

#####  Series object

In [ ]:
Simpsons.name = 'Simpsons weight'
Simpsons

Homer     120
Marge      60
Bart       35
Lisa       30
Maggie      7
Name: Simpsons weight, dtype: int64

##### of the index

In [ ]:
Simpsons.index.name = 'First name'
Simpsons

First name
Homer     120
Marge      60
Bart       35
Lisa       30
Maggie      7
Name: Simpsons weight, dtype: int64

##### of the column

In [ ]:
sp500_copy = sp500.rename(columns = {'Book Value': 'BookValue'})

checking if the column names in the original dataframe have changed

In [ ]:
sp500.columns

Index(['Sector', 'Price', 'Book Value'], dtype='object')

In [ ]:
sp500_copy.columns

Index(['Sector', 'Price', 'BookValue'], dtype='object')

this program code renames the column in place

In [ ]:
sp500_copy.rename(columns = {'Book Value': 'BookValue'},
            inplace=True)

see if the column name has changed

In [ ]:
sp500_copy.columns

Index(['Sector', 'Price', 'BookValue'], dtype='object')

### Output of values

#### first / last lines

In [ ]:
sp500.head()

                        Sector   Price  Book Value
Symbol
MMM                Industrials  141.14      26.668
ABT                Health Care   39.60      15.573
ABBV               Health Care   53.95       2.954
ACN     Information Technology   79.79       8.326
ACE                 Financials  102.91      86.897

In [ ]:
Simpsons.tail(3)

First name
Bart      35
Lisa      30
Maggie     7
Name: Simpsons weight, dtype: int64

#### columns

extracting the Sector column

In [ ]:
sp500['Sector'].head()

Symbol
MMM                Industrials
ABT                Health Care
ABBV               Health Care
ACN     Information Technology
ACE                 Financials
Name: Sector, dtype: object

dataframe column type:

In [ ]:
type(sp500['Sector'])

pandas.core.series.Series

extracting the Price and Book Value columns

In [ ]:
sp500[['Price', 'Book Value']].head()

         Price  Book Value
Symbol
MMM     141.14      26.668
ABT      39.60      15.573
ABBV     53.95       2.954
ACN      79.79       8.326
ACE     102.91      86.897

we show that the result is a Data Frame object

In [ ]:
type(sp500[['Price', 'Book Value']])

pandas.core.frame.DataFrame

attribute access to a column by name

In [ ]:
sp500.Price.head()

Symbol
MMM     141.14
ABT      39.60
ABBV     53.95
ACN      79.79
ACE     102.91
Name: Price, dtype: float64

#### rows

##### by tag

**Series**

In [ ]:
numbers.loc[[25,33]]

25   -1.085631
33    1.265936
dtype: float64

error - no label

In [ ]:
numbers.loc[0]

**DataFrame**

we get a string with the MMM index label, which is returned as a Series object

In [ ]:
sp500.loc['MMM']

Sector        Industrials
Price              141.14
Book Value         26.668
Name: MMM, dtype: object

In [ ]:
type(sp500.loc['MMM'])

pandas.core.series.Series

we get the strings MMM and MSFT the result will be a DataFrame object

In [ ]:
sp500.loc[['MMM', 'MSFT']]

                        Sector   Price  Book Value
Symbol
MMM                Industrials  141.14      26.668
MSFT    Information Technology   40.12      10.584

In [ ]:
type(sp500.loc[['MMM', 'MSFT']])

pandas.core.frame.DataFrame

##### by position

**Series**

In [ ]:
numbers

25   -1.085631
26    0.997345
27    0.282978
28   -1.506295
29   -0.578600
30    1.651437
31   -2.426679
32   -0.428913
33    1.265936
34   -0.866740
dtype: float64

by position

In [ ]:
numbers.iloc[[5,-5]]

30    1.651437
30    1.651437
dtype: float64

error:

In [ ]:
numbers.iloc[10]

**DataFrame**

we get the rows that have positions 0 and 2

In [ ]:
sp500.iloc[[0, 2]]

             Sector   Price  Book Value
Symbol
MMM     Industrials  141.14      26.668
ABBV    Health Care   53.95       2.954

we get the positions of the labels M and A in the index

In [ ]:
i1 = sp500.index.get_loc('MMM')
i2 = sp500.index.get_loc('A')
(i1, i2)

(0, 10)

and extract the strings

In [ ]:
sp500.iloc[[i1, i2]]

             Sector   Price  Book Value
Symbol
MMM     Industrials  141.14      26.668
A       Health Care   56.18      16.928

#### finding a scalar value

looking for a scalar value by the row label and the column label (name)

In [ ]:
sp500.at['MMM', 'Price']

141.14

search for a scalar value by row position and column position; extract the value in row 0, column 1

In [ ]:
sp500.iat[0, 1]

141.14

#### simultaneous selection of rows and columns

selecting rows with index labels ABT and ZTS for the Sector and Price columns

In [ ]:
sp500.loc[['ABT', 'ZTS']][['Sector', 'Price']]

             Sector  Price
Symbol
ABT     Health Care  39.60
ZTS     Health Care  30.53

In [ ]:
sp500.loc[['ABT', 'ZTS'],['Sector', 'Price']]

             Sector  Price
Symbol
ABT     Health Care  39.60
ZTS     Health Care  30.53

determining the position number of the specified placemarks

In [ ]:
print(sp500.index.get_loc('ABT'),sp500.index.get_loc('ZTS'))

1 499

selecting rows and columns by item number

In [ ]:
sp500.iloc[[1,499],[0,1]]

             Sector  Price
Symbol
ABT     Health Care  39.60
ZTS     Health Care  30.53

#### transpose

In [ ]:
sp500.head()

                        Sector   Price  Book Value
Symbol
MMM                Industrials  141.14      26.668
ABT                Health Care   39.60      15.573
ABBV               Health Care   53.95       2.954
ACN     Information Technology   79.79       8.326
ACE                 Financials  102.91      86.897

In [ ]:
sp500.T.head()

Symbol              MMM          ABT  ...        ZION          ZTS
Sector      Industrials  Health Care  ...  Financials  Health Care
Price            141.14         39.6  ...       28.43        30.53
Book Value       26.668       15.573  ...      30.191         2.15

[3 rows x 500 columns]

#### reindexing

error:

In [ ]:
sp500.loc[['MMM', 'ABBV', 'NEW VALUE']]

doing reindexing by setting the M, ABBA, and NEWVALUE labels

In [ ]:
reindexed = sp500.reindex(index=['MMM', 'ABBV', 'NEW VALUE'])

note that all indexes except those listed on the call are removed, and *NEW VALUE* contains the value *NaN*

In [ ]:
reindexed

                Sector   Price  Book Value
Symbol
MMM        Industrials  141.14      26.668
ABBV       Health Care   53.95       2.954
NEW VALUE          NaN     NaN         NaN

reindexing the columns

In [ ]:
sp500.reindex(columns=['Price', 'Book Value', 'NewCol']).head()

         Price  Book Value  NewCol
Symbol
MMM     141.14      26.668     NaN
ABT      39.60      15.573     NaN
ABBV     53.95       2.954     NaN
ACN      79.79       8.326     NaN
ACE     102.91      86.897     NaN

at the same time, we can fill in the missing values with constants instead of *NaN*

In [ ]:
sp500.reindex(columns=['Price',
                       'Book Value',
                       'NewCol'],
              fill_value=0).head()

         Price  Book Value  NewCol
Symbol
MMM     141.14      26.668       0
ABT      39.60      15.573       0
ABBV     53.95       2.954       0
ACN      79.79       8.326       0
ACE     102.91      86.897       0

#### random subsampling

selecting three random strings

In [ ]:
sp500.sample(n=3)

                        Sector  Price  Book Value
Symbol
ZION                Financials  28.43      30.191
NOV                     Energy  81.90      52.925
STX     Information Technology  51.95       8.080

random selection with return

In [ ]:
sp500.sample(frac=5, replace=True, random_state=777)

                        Sector   Price  Book Value
Symbol
CLF                  Materials   16.34      34.523
MHK     Consumer Discretionary  136.41      61.582
BDX                Health Care  115.70      27.510
HOT     Consumer Discretionary   78.73      17.218
CELG               Health Care  150.13      11.200
...                        ...     ...         ...
BTU                     Energy   17.22      14.644
MCO                 Financials   82.50       1.803
LRCX    Information Technology   60.61      29.677
CI                 Health Care   89.24      39.304
MCO                 Financials   82.50       1.803

[2500 rows x 3 columns]

#### [output settings](http://pandas.pydata.org/pandas-docs/stable/user_guide/options.html#available-options)

In [ ]:
pd.options.display.max_rows

60

In [ ]:
sp500

                        Sector   Price  Book Value
Symbol
MMM                Industrials  141.14      26.668
ABT                Health Care   39.60      15.573
ABBV               Health Care   53.95       2.954
ACN     Information Technology   79.79       8.326
ACE                 Financials  102.91      86.897
...                        ...     ...         ...
YHOO    Information Technology   35.02      12.768
YUM     Consumer Discretionary   74.77       5.147
ZMH                Health Care  101.84      37.181
ZION                Financials   28.43      30.191
ZTS                Health Care   30.53       2.150

[500 rows x 3 columns]

In [ ]:
pd.options.display.max_rows = 10

In [ ]:
sp500

                        Sector   Price  Book Value
Symbol
MMM                Industrials  141.14      26.668
ABT                Health Care   39.60      15.573
ABBV               Health Care   53.95       2.954
ACN     Information Technology   79.79       8.326
ACE                 Financials  102.91      86.897
...                        ...     ...         ...
YHOO    Information Technology   35.02      12.768
YUM     Consumer Discretionary   74.77       5.147
ZMH                Health Care  101.84      37.181
ZION                Financials   28.43      30.191
ZTS                Health Care   30.53       2.150

[500 rows x 3 columns]

In [ ]:
pd.options.display.max_rows

10

### Data slices

#### Series

We set the slice according to the rule: [start position: end position: step value], while:
- Right border-not included
- The step can be negative
- The position can also be negative - then the count is "from the other end"
- The numbering is from zero

In [ ]:
numbers

25   -1.085631
26    0.997345
27    0.282978
28   -1.506295
29   -0.578600
30    1.651437
31   -2.426679
32   -0.428913
33    1.265936
34   -0.866740
dtype: float64

a slice containing elements with positions from 1 to 5

In [ ]:
numbers.iloc[1:6]

26    0.997345
27    0.282978
28   -1.506295
29   -0.578600
30    1.651437
dtype: float64

select items in positions 1, 3, 5 == select items from 1 to 5 position in increments of 2

In [ ]:
numbers.iloc[1:6:2]

26    0.997345
28   -1.506295
30    1.651437
dtype: float64

we can only leave the final position

In [ ]:
numbers.iloc[:6]

25   -1.085631
26    0.997345
27    0.282978
28   -1.506295
29   -0.578600
30    1.651437
dtype: float64

or we will leave only the initial position

In [ ]:
numbers.iloc[3:]

28   -1.506295
29   -0.578600
30    1.651437
31   -2.426679
32   -0.428913
33    1.265936
34   -0.866740
dtype: float64

selecting the Series elements in reverse order, starting with 5

In [ ]:
numbers.iloc[5::-1]

30    1.651437
29   -0.578600
28   -1.506295
27    0.282978
26    0.997345
25   -1.085631
dtype: float64

selecting the last 4 rows

In [ ]:
numbers.iloc[-4:]

31   -2.426679
32   -0.428913
33    1.265936
34   -0.866740
dtype: float64

####  DataFrame

In [ ]:
sp500.iloc[:5]

                        Sector   Price  Book Value
Symbol
MMM                Industrials  141.14      26.668
ABT                Health Care   39.60      15.573
ABBV               Health Care   53.95       2.954
ACN     Information Technology   79.79       8.326
ACE                 Financials  102.91      86.897

in reverse order

In [ ]:
sp500.iloc[4::-1]

                        Sector   Price  Book Value
Symbol
ACE                 Financials  102.91      86.897
ACN     Information Technology   79.79       8.326
ABBV               Health Care   53.95       2.954
ABT                Health Care   39.60      15.573
MMM                Industrials  141.14      26.668

lines starting with the ABT label and ending with the ACN label

In [ ]:
sp500.loc['ABT':'ACN']

                        Sector  Price  Book Value
Symbol
ABT                Health Care  39.60      15.573
ABBV               Health Care  53.95       2.954
ACN     Information Technology  79.79       8.326

### Copying and links

In [ ]:
numbers

25   -1.085631
26    0.997345
27    0.282978
28   -1.506295
29   -0.578600
30    1.651437
31   -2.426679
32   -0.428913
33    1.265936
34   -0.866740
dtype: float64

elements from 1 to 4

In [ ]:
numbers.iloc[[1,2,3,4]]

26    0.997345
27    0.282978
28   -1.506295
29   -0.578600
dtype: float64

saved to the variable n

In [ ]:
n = numbers.iloc[[1,2,3,4]]

In [ ]:
n

26    0.997345
27    0.282978
28   -1.506295
29   -0.578600
dtype: float64

assign the value 0 to all elements

In [ ]:
n.loc[:] = 0
n

26    0.0
27    0.0
28    0.0
29    0.0
dtype: float64

did anything happen to numbers?

In [ ]:
numbers

25   -1.085631
26    0.997345
27    0.282978
28   -1.506295
29   -0.578600
30    1.651437
31   -2.426679
32   -0.428913
33    1.265936
34   -0.866740
dtype: float64

once again, save the first 4 elements

In [ ]:
n = numbers.iloc[[1,2,3,4]]
n

26    0.997345
27    0.282978
28   -1.506295
29   -0.578600
dtype: float64

creating a variable k = slice from 1 to 4 elements

In [ ]:
k = numbers[1:5]
k.loc[:] = 0
k

26    0.0
27    0.0
28    0.0
29    0.0
dtype: float64

In [ ]:
numbers

25   -1.085631
26    0.000000
27    0.000000
28    0.000000
29    0.000000
30    1.651437
31   -2.426679
32   -0.428913
33    1.265936
34   -0.866740
dtype: float64

restored numbers

In [ ]:
numbers[1:5] = n
numbers

25   -1.085631
26    0.997345
27    0.282978
28   -1.506295
29   -0.578600
30    1.651437
31   -2.426679
32   -0.428913
33    1.265936
34   -0.866740
dtype: float64

###  Removal

#### del

Series

In [ ]:
Simpsons

First name
Homer     120
Marge      60
Bart       35
Lisa       30
Maggie      7
Name: Simpsons weight, dtype: int64

In [ ]:
Simpsons_copy = Simpsons.copy()
del Simpsons_copy['Maggie']
Simpsons_copy

First name
Homer    120
Marge     60
Bart      35
Lisa      30
Name: Simpsons weight, dtype: int64

DataFrame

In [ ]:
sp500.head()

                        Sector   Price  Book Value
Symbol
MMM                Industrials  141.14      26.668
ABT                Health Care   39.60      15.573
ABBV               Health Care   53.95       2.954
ACN     Information Technology   79.79       8.326
ACE                 Financials  102.91      86.897

In [ ]:
sp500_copy = sp500.copy()
del sp500_copy['Price']
sp500_copy.iloc[:2]

             Sector  Book Value
Symbol
MMM     Industrials      26.668
ABT     Health Care      15.573

#### pop

In [ ]:
sp500_copy = sp500.copy()

In [ ]:
sp500_copy.head(3)

             Sector   Price  Book Value
Symbol
MMM     Industrials  141.14      26.668
ABT     Health Care   39.60      15.573
ABBV    Health Care   53.95       2.954

this row will delete the Sector column and return it as a series

In [ ]:
popped_column = sp500_copy.pop('Sector')

the Sector column is deleted in place

In [ ]:
sp500_copy.head(3)

         Price  Book Value
Symbol
MMM     141.14      26.668
ABT      39.60      15.573
ABBV     53.95       2.954

and we have the Sector column obtained as a result of applying pop

In [ ]:
popped_column.head(3)

Symbol
MMM     Industrials
ABT     Health Care
ABBV    Health Care
Name: Sector, dtype: object

For Series application .pop is identical

#### drop

In [ ]:
sp500_copy = sp500.copy()

In [ ]:
sp500_copy.head(3)

             Sector   Price  Book Value
Symbol
MMM     Industrials  141.14      26.668
ABT     Health Care   39.60      15.573
ABBV    Health Care   53.95       2.954

- this row will return a new dataframe with the 'Sector’column removed
- the dataframe copy will not change

In [ ]:
sp500_copy_after_drop = sp500_copy.drop(['Sector'], axis = 1)
sp500_copy_after_drop.head(3)

         Price  Book Value
Symbol
MMM     141.14      26.668
ABT      39.60      15.573
ABBV     53.95       2.954

In [ ]:
sp500_copy.head(3)

             Sector   Price  Book Value
Symbol
MMM     Industrials  141.14      26.668
ABT     Health Care   39.60      15.573
ABBV    Health Care   53.95       2.954

we get a copy of the first 5 lines of the data dataframe

In [ ]:
sp500_part_copy = sp500.iloc[:5].copy()
sp500_part_copy

                        Sector   Price  Book Value
Symbol
MMM                Industrials  141.14      26.668
ABT                Health Care   39.60      15.573
ABBV               Health Care   53.95       2.954
ACN     Information Technology   79.79       8.326
ACE                 Financials  102.91      86.897

deleting rows with the ABT and ACN labels

In [ ]:
sp500_part_copy = sp500_part_copy.drop(['ABT', 'ACN'], axis=0)
sp500_part_copy.head(5)

             Sector   Price  Book Value
Symbol
MMM     Industrials  141.14      26.668
ABBV    Health Care   53.95       2.954
ACE      Financials  102.91      86.897

For Series application .drop is identical

### Фильтрация по условию

#### Series

In [ ]:
numbers

25   -1.085631
26    0.997345
27    0.282978
28   -1.506295
29   -0.578600
30    1.651437
31   -2.426679
32   -0.428913
33    1.265936
34   -0.866740
dtype: float64

which rows have values greater than 0 and less than 1?

In [ ]:
logical_results = (numbers > 0) & (numbers < 1)
logical_results

25    False
26     True
27     True
28    False
29    False
30    False
31    False
32    False
33    False
34    False
dtype: bool

Brackets!!! The following program code will throw an exception
```python
numbers > 0 & numbers < 1 
```

the type of the result obtained is Series, which can be used to select the values we are interested in

In [ ]:
type(logical_results)

pandas.core.series.Series

selecting rows with the value True

In [ ]:
numbers[logical_results]

26    0.997345
27    0.282978
dtype: float64

using the method .where

In [ ]:
numbers.where((numbers > 0) & (numbers < 1))

25         NaN
26    0.997345
27    0.282978
28         NaN
29         NaN
30         NaN
31         NaN
32         NaN
33         NaN
34         NaN
dtype: float64

In [ ]:
numbers.where((numbers > 0) & (numbers < 1), other = -1)

25   -1.000000
26    0.997345
27    0.282978
28   -1.000000
29   -1.000000
30   -1.000000
31   -1.000000
32   -1.000000
33   -1.000000
34   -1.000000
dtype: float64

are all elements >= 0?

In [ ]:
(numbers >= 0).all()

False

is there an element < 2?

In [ ]:
(numbers < 2).any()

True

how many values are < 1?

In [ ]:
numbers < 1

25     True
26     True
27     True
28     True
29     True
30    False
31     True
32     True
33    False
34     True
dtype: bool

In [ ]:
(numbers < 1).sum()

8

#### DataFrame

which rows have the value Price < 100?

In [ ]:
sp500.Price < 100

Symbol
MMM     False
ABT      True
ABBV     True
ACN      True
ACE     False
        ...
YHOO     True
YUM      True
ZMH     False
ZION     True
ZTS      True
Name: Price, Length: 500, dtype: bool

now we get the rows where Price < 100

In [ ]:
sp500[sp500.Price < 100]

                        Sector  Price  Book Value
Symbol
ABT                Health Care  39.60      15.573
ABBV               Health Care  53.95       2.954
ACN     Information Technology  79.79       8.326
ADBE    Information Technology  64.30      13.262
AES                  Utilities  13.61       5.781
...                        ...    ...         ...
XYL                Industrials  38.42      12.127
YHOO    Information Technology  35.02      12.768
YUM     Consumer Discretionary  74.77       5.147
ZION                Financials  28.43      30.191
ZTS                Health Care  30.53       2.150

[407 rows x 3 columns]

we extract only those rows in which the value of Price < 10 and > 6

In [ ]:
r = sp500[(sp500['Price'] < 10) & 
          (sp500.Price > 6)] ['Price']
r

Symbol
HCBK    9.80
HBAN    9.10
SLM     8.82
WIN     9.38
Name: Price, dtype: float64

retrieving rows where the Sector variable takes the HealthCare value and the Price variable is greater than or equal to 100.00

In [ ]:
r = sp500[(sp500.Sector == 'Health Care') & 
          (sp500.Price >= 100.00)] [['Price', 'Sector']]
r

         Price       Sector
Symbol
ACT     213.77  Health Care
ALXN    162.30  Health Care
AGN     166.92  Health Care
AMGN    114.33  Health Care
BCR     146.62  Health Care
...        ...          ...
REGN    297.77  Health Care
TMO     115.74  Health Care
WAT     100.54  Health Care
WLP     108.82  Health Care
ZMH     101.84  Health Care

[19 rows x 2 columns]

using the .isin method

In [ ]:
s_tmp = sp500.Sector.isin(['Information Technology', 'Financials'])
s_tmp

Symbol
MMM     False
ABT     False
ABBV    False
ACN      True
ACE      True
        ...
YHOO     True
YUM     False
ZMH     False
ZION     True
ZTS     False
Name: Sector, Length: 500, dtype: bool

In [ ]:
sp500[s_tmp].head()

                        Sector   Price  Book Value
Symbol
ACN     Information Technology   79.79       8.326
ACE                 Financials  102.91      86.897
ADBE    Information Technology   64.30      13.262
AFL                 Financials   61.31      34.527
AKAM    Information Technology   53.65      15.193

using the method .query

In [ ]:
r = sp500[(sp500.Sector == 'Health Care') & 
          (sp500.Price >= 100.00)] [['Price', 'Sector']]
r

         Price       Sector
Symbol
ACT     213.77  Health Care
ALXN    162.30  Health Care
AGN     166.92  Health Care
AMGN    114.33  Health Care
BCR     146.62  Health Care
...        ...          ...
REGN    297.77  Health Care
TMO     115.74  Health Care
WAT     100.54  Health Care
WLP     108.82  Health Care
ZMH     101.84  Health Care

[19 rows x 2 columns]

In [ ]:
q = sp500.query("Sector=='Health Care' & Price >= 100")[['Price', 'Sector']]
q

         Price       Sector
Symbol
ACT     213.77  Health Care
ALXN    162.30  Health Care
AGN     166.92  Health Care
AMGN    114.33  Health Care
BCR     146.62  Health Care
...        ...          ...
REGN    297.77  Health Care
TMO     115.74  Health Care
WAT     100.54  Health Care
WLP     108.82  Health Care
ZMH     101.84  Health Care

[19 rows x 2 columns]

### Adding

#### operator [ ]

creating a copy so that the original data remains unchanged

In [ ]:
sp500_copy = sp500.copy()

adding a column

In [ ]:
sp500_copy['RoundedPrice'] = sp500_copy.Price.round()
sp500_copy.head(3)

             Sector   Price  Book Value  RoundedPrice
Symbol
MMM     Industrials  141.14      26.668         141.0
ABT     Health Care   39.60      15.573          40.0
ABBV    Health Care   53.95       2.954          54.0

#### method .insert()

creating a copy so that the original data remains unchanged

In [ ]:
sp500_copy = sp500.copy()

inserting the RoundedPrice column as the third column of the dataframe

In [ ]:
sp500_copy.insert(1, 'RoundedPrice', sp500_copy.Price.round())
sp500_copy.head(3)

             Sector  RoundedPrice   Price  Book Value
Symbol
MMM     Industrials         141.0  141.14      26.668
ABT     Health Care          40.0   39.60      15.573
ABBV    Health Care          54.0   53.95       2.954

#### method .assign()

creating a copy so that the original data remains unchanged

In [ ]:
sp500_copy = sp500.copy()

adding two columns at the same time:

In [ ]:
sp500_copy.assign(Rounded_Price=sp500_copy.Price.round(),
                  R_BookValue_Price=lambda x: (x['Book Value'] / x['Rounded_Price']))

                        Sector   Price  ...  Rounded_Price  R_BookValue_Price
Symbol                                  ...
MMM                Industrials  141.14  ...          141.0           0.189135
ABT                Health Care   39.60  ...           40.0           0.389325
ABBV               Health Care   53.95  ...           54.0           0.054704
ACN     Information Technology   79.79  ...           80.0           0.104075
ACE                 Financials  102.91  ...          103.0           0.843660
...                        ...     ...  ...            ...                ...
YHOO    Information Technology   35.02  ...           35.0           0.364800
YUM     Consumer Discretionary   74.77  ...           75.0           0.068627
ZMH                Health Care  101.84  ...          102.0           0.364520
ZION                Financials   28.43  ...           28.0           1.078250
ZTS                Health Care   30.53  ...           31.0           0.069355

[500 rows x 5 columns]

### Data alignment

#### Series

first series for examples

In [ ]:
s_1 = pd.Series(data=[77,33,11],index=['a','b','f'])
s_1

a    77
b    33
f    11
dtype: int64

second series for examples

In [ ]:
s_2 = pd.Series(data=[11,5,6],index=['c','b','a'])
s_2

c    11
b     5
a     6
dtype: int64

for the disjoint part of the indexes, the NaN values will be obtained

In [ ]:
s_1+s_2

a    83.0
b    38.0
c     NaN
f     NaN
dtype: float64

the labels don't have to be unique

In [ ]:
s_1 = pd.Series(data=[77, 33, 15, 3], index=['a', 'a', 'a', 'd'])
s_1

a    77
a    33
a    15
d     3
dtype: int64

In [ ]:
s_2 = pd.Series(data=[11, 5, 6], index=['c', 'a', 'a'])
s_2

c    11
a     5
a     6
dtype: int64

3 'a' labels and 2 'a' labels, the result is 6 ' a ' labels

In [ ]:
s_2+s_1

a    82.0
a    38.0
a    20.0
a    83.0
a    39.0
a    21.0
c     NaN
d     NaN
dtype: float64

#### DataFrame

In [ ]:
sp500_part_1 = sp500.iloc[0:5, 0:2].copy()
sp500_part_2 = sp500.iloc[2:7, 1:3].copy()

In [ ]:
sp500_part_1

                        Sector   Price
Symbol
MMM                Industrials  141.14
ABT                Health Care   39.60
ABBV               Health Care   53.95
ACN     Information Technology   79.79
ACE                 Financials  102.91

In [ ]:
sp500_part_2

         Price  Book Value
Symbol
ABBV     53.95       2.954
ACN      79.79       8.326
ACE     102.91      86.897
ACT     213.77      55.188
ADBE     64.30      13.262

In [ ]:
sp500_part_1 + sp500_part_2

        Book Value   Price  Sector
Symbol
ABBV           NaN  107.90     NaN
ABT            NaN     NaN     NaN
ACE            NaN  205.82     NaN
ACN            NaN  159.58     NaN
ACT            NaN     NaN     NaN
ADBE           NaN     NaN     NaN
MMM            NaN     NaN     NaN

alignment occurs when creating a dataframe

In [ ]:
series_1 = pd.Series([70, 90])
series_2 = pd.Series([71, 91])
series_3 = pd.Series([85, 87], index=[1, 2])
df = pd.DataFrame({'col_1': series_1,
                   'col_2': series_2,
                   'col_3': series_3})
df

   col_1  col_2  col_3
0   70.0   71.0    NaN
1   90.0   91.0   85.0
2    NaN    NaN   87.0

### Sorting

#### by index

In [ ]:
sp500.head()

                        Sector   Price  Book Value
Symbol
MMM                Industrials  141.14      26.668
ABT                Health Care   39.60      15.573
ABBV               Health Care   53.95       2.954
ACN     Information Technology   79.79       8.326
ACE                 Financials  102.91      86.897

In [ ]:
sp500.sort_index().head()

                        Sector   Price  Book Value
Symbol
A                  Health Care   56.18      16.928
AA                   Materials   13.52       9.670
AAPL    Information Technology  614.13     139.460
ABBV               Health Care   53.95       2.954
ABC                Health Care   71.64       9.430

In [ ]:
sp500.sort_index(axis=1).head()

        Book Value   Price                  Sector
Symbol
MMM         26.668  141.14             Industrials
ABT         15.573   39.60             Health Care
ABBV         2.954   53.95             Health Care
ACN          8.326   79.79  Information Technology
ACE         86.897  102.91              Financials

#### by value

In [ ]:
sp500.sort_values(by='Price').head()

                             Sector  Price  Book Value
Symbol
BEAM         Consumer Discretionary   0.00         NaN
FTR     Telecommunications Services   5.81       3.989
SLM                      Financials   8.82      11.895
HBAN                     Financials   9.10       6.995
WIN     Telecommunications Services   9.38       1.199

In [ ]:
sp500.sort_values(by='Price', ascending=False).head()

                        Sector    Price  Book Value
Symbol
PCLN               Industrials  1197.12     137.886
GHC     Consumer Discretionary   677.29       0.000
AAPL    Information Technology   614.13     139.460
GOOG    Information Technology   552.70     135.977
AZO     Consumer Discretionary   540.90     -51.275

#### lowest / highest value

In [ ]:
sp500.nsmallest(5, 'Price')

                             Sector  Price  Book Value
Symbol
BEAM         Consumer Discretionary   0.00         NaN
FTR     Telecommunications Services   5.81       3.989
SLM                      Financials   8.82      11.895
HBAN                     Financials   9.10       6.995
WIN     Telecommunications Services   9.38       1.199

In [ ]:
sp500.nlargest(5, 'Price')

                        Sector    Price  Book Value
Symbol
PCLN               Industrials  1197.12     137.886
GHC     Consumer Discretionary   677.29       0.000
AAPL    Information Technology   614.13     139.460
GOOG    Information Technology   552.70     135.977
AZO     Consumer Discretionary   540.90     -51.275